<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Impression</title><meta content="DocBook XSL Stylesheets V1.73.2" name="generator"><link rel="start" href="index.html" title="GRIF 2013Arbre de d&eacute;faillance"><link rel="up" href="index.html" title="GRIF 2013Arbre de d&eacute;faillance"><link rel="prev" href="ar01s05.html" title="Exemple d'arbre de d&eacute;faillances"><link rel="next" href="ar01s07.html" title="Calculs"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="section" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="Impression"></a>Impression</h2></div></div></div><p>
		Concernant l'impression, l'utilisateur a plusieurs commandes &agrave; sa disposition dans le menu
		<b>Fichier</b>:
		<p>
		</p>
		<div class="itemizedlist"><p>
			</p><ul type="disc"><li><p>
				La fonction <b>Mise en page</b> permet de choisir l'orientation des pages, 
				la dimension des marges...
				<div class="mediaobject" align="center"><img src="./impression/MiseEnPage.gif" align="middle"></div>
			</p></li><li><p>
				La fonction <b>Imprimer</b> permet d'exporter tout ou partie du document au format .pdf.
				Les graphiques sont export&eacute;s dans un format vectoriel afin de pouvoir redimensionner ces derniers 
				&agrave; votre convenance et sans d&eacute;gradation.
				
				<div class="mediaobject" align="center"><img src="./impression/ImpPdf_fr.gif" align="middle"></div>
				<p>
					Une fen&ecirc;tre d'impression s'ouvre alors, 
					l'utilisateur peut s&eacute;lectionner les pages &agrave; imprimer et configurer les propri&eacute;t&eacute;s d'impression
					<div class="itemizedlist"><ul type="circle"><li><p>
						<b>Impression du document</b> : Permet d'imprimer tout le document.
					</p></li><li><p>
						<b>Impression de la page en cours</b> : Permet d'imprimer la page en cours.
					</p></li><li><p>
						<b>Impression de la s&eacute;lection</b> : Permet de s&eacute;lectionner les pages ou groupes de pages &agrave; imprimer.
						L'option <b>Impression les pages s&eacute;lectionn&eacute;es partiellement</b> vous permet d'imprimer ou non les pages marqu&eacute;es d'un carr&eacute; bleu.
					</p></li><li><p>
						<b>Imprimer le cadre</b> : Imprime un cadre autour de chaque page &agrave; imprimer.
					</p></li><li><p>
						<b>Imprimer le nom du fichier </b> : Imprime le nom du fichier en haut &agrave; gauche de chaque page.
					</p></li><li><p>
						<b>Imprimer le num&eacute;ro de page</b> : Imprime le nom et le num&eacute;ro en bas de chaque page .
					</p></li><li><p>
						<b>Imprimer la date</b> : Imprime la date en haut &agrave; droite de chaque page.
					</p></li></ul></div>
				</p>
			</p></li><li><p>
				La fonction <b>Sauver dans un fichier RTF...</b>permet d'acc&eacute;der dans un premier temps &agrave; 
				une fen&ecirc;tre appel&eacute;e <b>Propri&eacute;t&eacute; d'impression</b>. Puis &agrave; une
				autre intitul&eacute;e <b>Information</b>. Dans un troisi&egrave;me temps, l'utilisateur 
				arrive sur une fen&ecirc;tre permettant de choisir le dossier dans lequel il d&eacute;sire que le fichier RTF soit enregistr&eacute;.
				<div class="mediaobject" align="center"><img src="./impression/ProprieteImp.gif" align="middle"></div>
				<p>
					Lorsque l'utilisateur s&eacute;lectionne la fonction <b>Sauver dans un fichier RTF</b>, c'est
					le cadre ci-dessus qui appara&icirc;t dans un premier temps. Il peut alors s&eacute;lectionner ses
					pr&eacute;f&eacute;rences: imprimer le cadre, le nom du fichier, le num&eacute;ro de la page ou/et la date.
				</p>
				<p>
				</p>
				<div class="mediaobject" align="center"><img src="./impression/InfoImp.gif" align="middle"></div>
				<p>
					Dans un second temps, c'est la fen&ecirc;tre <b>Information</b> qui appara&icirc;t.
					Elle permet &agrave; l'utilisateur d'indiquer s'il veut enregistrer la vue courante, la page courante
					ou la totalit&eacute; du document.
				</p>
			</p></li></ul></div>
	</p></div></body></html>