<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>Options de GRIF - Arbre de d&eacute;faillance</title><meta content="DocBook XSL Stylesheets V1.73.2" name="generator"><link rel="start" href="index.html" title="GRIF 2013Arbre de d&eacute;faillance"><link rel="up" href="index.html" title="GRIF 2013Arbre de d&eacute;faillance"><link rel="prev" href="ar01s10.html" title="Enregistrer"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="section" lang="fr"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="Options"></a>Options de GRIF - Arbre de d&eacute;faillance</h2></div></div></div><p>
Le menu <b>Outils - Options de l'application </b> ouvre une fen&ecirc;tre avec les onglets suivants :
  </p><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_002_EXECUTABLES"></a>Ex&eacute;cutables</h3></div></div></div><p>L'onglet Ex&eacute;cutables permet d'indiquer les chemins des ex&eacute;cutables externes : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Editeur </b> : Permet d'indiquer l'ex&eacute;cutable &agrave; utiliser pour &eacute;diter les donn&eacute;es.
      </p></li><li><p>
        <b>Client mail</b> : Permet de sp&eacute;cifier le client mail &agrave; utiliser
      </p></li><li><p>
        <b>Ouvrir automatiquement les PDF </b> : Permet d'indiquer si les rapports PDF doivent &ecirc;tre ouverts apr&egrave;s g&eacute;n&eacute;ration.
      </p></li><li><p>
        <b>Feuille de style XML vers DocBook.</b> : Feuille de style permettant de convertir le rapport XML en fichier docbook.
      </p></li><li><p>
        <b>Feuille de style XML vers HTML.</b> : Feuille de style permettant de convertir le rapport XML en fichier docbook.
      </p></li><li><p>
        <b>Feuille de style DocBook vers PDF.</b> : Feuille de style permettant de convertir un fichier docbook en fichier pdf.
      </p></li><li><p>
        <b>Chemin de Moca-RPC </b> : Indique le chemin de Moca version 12.
      </p></li><li><p>
        <b>Chemin de javaw </b> : Chemin de l'ex&eacute;cutable javaw.exe :
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_004_BDD"></a>Base de donn&eacute;es</h3></div></div></div><p>L'onglet Base de donn&eacute;es permet de configurer la connexion &agrave; une base de donn&eacute;es : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Utiliser la connexion &agrave; la base de donn&eacute;es </b> : Indique s'il faut ou non se connecter &agrave; la base de donn&eacute;es.
      </p></li><li><p>
        <b>Nom </b> : Le nom de la base sera inscrit dans les param&egrave;tres lors de leur mise &agrave; jour. Cela permet de savoir depuis quelle base il a &eacute;t&eacute; mis &agrave; jour la derni&egrave;re fois.
      </p></li><li><p>
        <b>Driver JDBC </b> : Permet de saisir le nom du driver &agrave; utiliser pour se connecter &agrave; la base (sun.jdbc.odbc.JdbcOdbcDriver, oracle.jdbc.driver.OracleDriver, ...).
      </p></li><li><p>
        <b>Connexion &agrave; la base </b> : Url de connexion o&ugrave; se trouve la base.
      </p></li><li><p>
        <b>Option de connexion </b> : Propri&eacute;t&eacute;s de la connexion.
      </p></li><li><p>
        <b>Login </b> : Login &agrave; utiliser pour se connecter &agrave; la base.
      </p></li><li><p>
        <b>Mot de passe </b> : Password &agrave; utiliser pour se connecter &agrave; la base.
      </p></li><li><p>
        <b>Requ&ecirc;te SQL </b> : Requ&ecirc;te qui doit &ecirc;tre ex&eacute;cut&eacute; pour r&eacute;cup&eacute;rer les informations utiles.
      </p></li><li><p>
        <b>Nom du champ pour l'ID </b> : Nom du champ contenant l'identifiant des donn&eacute;es.
      </p></li><li><p>
        <b>Type d'identifiant </b> : Type de champ de l'identifiant (INTEGER, FLOAT, VARCHAR(32), ...).
      </p></li><li><p>
        <b>Nom du champ pour le nom </b> : Nom du champ contenant le nom des donn&eacute;es.
      </p></li><li><p>
        <b>Nom du champ pour la valeur </b> : Nom du champ contenant la valeur des donn&eacute;es.
      </p></li><li><p>
        <b>Nom du champ de description </b> : Nom du champ contenant la description des donn&eacute;es.
      </p></li><li><p>
        <b>Nom du champ de dimension </b> : Nom du champ contenant la dimension des donn&eacute;es.
      </p></li><li><p>
        <b>Tester la connexion</b> : Nom du champ contenant la description des donn&eacute;es.
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_006_LANGUAGE"></a>Langage</h3></div></div></div><p>L'onglet Langue permet de choisir sa langue : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Langage</b> : Le changement de langue est effectif lors de la fermeture de la fen&ecirc;tre d'option. Les langues disponibles sont le Fran&ccedil;ais et l'Anglais.
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_008_OPTIONS"></a>Options</h3></div></div></div><p>L'onglet Options regroupe les options modifiant le comportement de l'application : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Enregistrer les options du document courant  comme options par d&eacute;faut  dans l'application </b> : Enregistre les options du document courant comme les options par d&eacute;faut de l'application.
      </p></li><li><p>
        <b>L'application g&egrave;re les options par d&eacute;faut  des documents. Appliquer les options par d&eacute;faut  au document courant </b> : Applique les options -options d'application- au document courant.
      </p></li><li><p>
        <b>Delai en minutes des sauvegardes automatiques</b> : Delai entre chaque sauvegarde automatique. Une valeur &lt;= 0 d&eacute;sactive la fonctionnalit&eacute;. 
      </p></li><li><p>
        <b>Nombre maximum d'annulations </b> : Indique le nombre d'annuler/refaire disponible.
      </p></li><li><p>
        <b>Nombre de fichiers r&eacute;cents </b> : Indique le nombre de fichier dans la liste des fichiers r&eacute;cemment ouverts.
      </p></li><li><p>
        <b>Affichage des fen&ecirc;tres </b> : Permet d'avoir des tableaux ind&eacute;pendants (externes) ou non (internes) de la fen&ecirc;tre principale.
      </p></li><li><p>
        <b>Colonnes redimensionn&eacute;es dans les tableaux  </b> : Permet de choisir sur quelle(s) colonne(s) sera pris l'espace lors d'un redimensionnement de colonne.
      </p></li><li><p>
        <b>G&eacute;rer les nouveaux noms en &eacute;vitant les doublons </b> : Permet d'&eacute;viter les conflits de nom en cr&eacute;ant des objets dont le nom est unique (lors des copier/coller principalement).
      </p></li><li><p>
        <b>Ajouter le suffixe "Copy" lors des copier-coller </b> : Permet d'ajouter le suffixe "Copy" au nom des objets coll&eacute;s.
      </p></li><li><p>
        <b>Synchroniser la vue avec les tableaux </b> : Provoque la s&eacute;lection d'un objet dans les tableaux de donn&eacute;es quand on le s&eacute;lectionne dans la vue.
      </p></li><li><p>
        <b>Synchroniser la vue avec l'arborescence </b> : Provoque la s&eacute;lection d'un objet dans l'arborescence quand on le s&eacute;lectionne dans la vue.
      </p></li><li><p>
        <b>Dans les r&eacute;sultats, afficher la description  &agrave; la place du nom par d&eacute;faut </b> : Permet d'afficher les commentaires/descriptions des objets dans les fen&ecirc;tre de r&eacute;sultats. Cela est parfois plus utile que d'afficher un nom par d&eacute;faut sans signification.
      </p></li><li><p>
        <b>D&eacute;coupage automatique des fichiers import&eacute;s </b> : D&eacute;coupage automatique de l'abre lors de l'import de fichiers (*.xml or *.dag)
      </p></li><li><p>
        <b>D&eacute;coupage automatique &agrave; partir de la profondeur </b> : Lorsque l'arbre est d&eacute;coup&eacute; automatiquement, la coupe sera faite &agrave; partir de la Ni&egrave;me porte.
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_010_GRAPH"></a>Graphiques</h3></div></div></div><p>L'onglet Graphique permet de modifier l'aspect de la base graphique : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Utiliser le style Windows </b> : Utilise le look and feel de votre syst&egrave;me &agrave; la place du style java (n&eacute;cessite un red&eacute;marrage de GRIF).
      </p></li><li><p>
        <b>Taille des &eacute;l&eacute;ments </b> : Permet de changer la taille des &eacute;l&eacute;ments graphiques.
      </p></li><li><p>
        <b>Taille des commentaires </b> : Permet de sp&eacute;cifier la taille de la police des commentaires.
      </p></li><li><p>
        <b>Taille des groupes </b> : Permet de sp&eacute;cifier la taille de la police des groupes.
      </p></li><li><p>
        <b>Activer le r&eacute;ticule </b> : Active un r&eacute;ticule permettant d'aligner les objets lors de leur s&eacute;lection.
      </p></li><li><p>
        <b>Activer le lissage du texte </b> : Active l'anti-aliasing (lissage) sur les textes, ce processus peut ralentir l'affichage.
      </p></li><li><p>
        <b>Activer le lissage des dessins  </b> : Active l'anti-aliasing (lissage) sur les dessins, ce processus peut ralentir l'affichage.
      </p></li><li><p>
        <b>Afficher les info-bulles </b> : Active le syst&egrave;me d'infobulle.
      </p></li><li><p>
        <b>&lt;html&gt;Utiliser le symbole des portes &lt;br&gt;lors de la mise en page &lt;html&gt;</b> : Utilise seulement le symbole de la porte pour la centrer horizontalement lors de la mise en page automatique, et pas la totalit&eacute; de la porte (zone pointill&eacute;e lors de la s&eacute;lection).
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_011_DIGITS"></a>Format num&eacute;rique</h3></div></div></div><p>L'onglet format num&eacute;rique permet de choisir le format des nombres affich&eacute;s dans l'application : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Affichage des param&egrave;tres </b> : Permet de sp&eacute;cifier le format d'affichage pour les param&egrave;tres (chiffres apr&egrave;s la virgule, ...)
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_021_EVENT"></a>Ev&eacute;nements</h3></div></div></div><p>L'onglet Ev&eacute;nements permet de modifier l'affichage des &eacute;v&eacute;nements. : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Taille des labels </b> : Permet de sp&eacute;cifier la taille de la police du label.
      </p></li><li><p>
        <b>Afficher le nom </b> : Permet d'afficher ou non le nom.
      </p></li><li><p>
        <b>Afficher la description  </b> : Permet d'afficher ou non la description.
      </p></li><li><p>
        <b>Afficher la loi </b> : Permet d'afficher ou non la loi.
      </p></li><li><p>
        <b>Afficher les DCC </b> : Permet d'afficher ou non les d&eacute;faillances de causes communes.
      </p></li><li><p>
        <b>Afficher objectif</b> : Affiche l'objectif de valeur &agrave; cot&eacute; de chaque porte.
      </p></li><li><p>
        <b>Informations suppl&eacute;mentaires </b> : Permet d'afficher des informations suppl&eacute;mentaires (r&eacute;sultats de calculs) 
      </p></li><li><p>
        <b>Utiliser une loi par d&eacute;faut  </b> : Permet d'utiliser une loi particuli&egrave;re comme loi par d&eacute;faut.
      </p></li><li><p>
        <b>Loi par d&eacute;faut  </b> : Permet de d&eacute;finir la loi &agrave; utiliser par d&eacute;faut.
      </p></li><li><p>
        <b>Hauteur du commentaire</b> : Hauteur (en pixels) du commentaire situ&eacute; en haut de l'&eacute;v&egrave;nement. La valeur par d&eacute;faut est 40.
      </p></li><li><p>
        <b>Largeur du commentaire</b> : Largeur (en pixels) du commentaire situ&eacute; en haut de l'&eacute;v&egrave;nement. La valeur par d&eacute;faut est 100.
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_025_DOOR_REP"></a>Portes/Renvois</h3></div></div></div><p>L'onglet Portes/Renvois permet de modifier l'affichage des portes et renvois : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Taille des labels </b> : Permet de sp&eacute;cifier la taille de la police du label.
      </p></li><li><p>
        <b>Afficher le nom </b> : Permet d'afficher ou non le nom.
      </p></li><li><p>
        <b>Afficher la description  </b> : Permet d'afficher ou non la description.
      </p></li><li><p>
        <b>Affichage du K/N </b> : Permet d'afficher ou non le K/N.
      </p></li><li><p>
        <b>Afficher la localisation des renvois </b> : Affiche l'ensemble des renvois relatifs &agrave; la porte.
      </p></li><li><p>
        <b>Afficher objectif</b> : Affiche l'objectif de valeur &agrave; cot&eacute; de chaque porte.
      </p></li><li><p>
        <b>Informations suppl&eacute;mentaires </b> : Permet d'afficher des informations suppl&eacute;mentaires (r&eacute;sultats de calculs) 
      </p></li><li><p>
        <b>Affichage du nom de la source des renvois </b> : Affiche le nom de la porte &agrave; laquelle correspond le renvoi.
      </p></li><li><p>
        <b>Affichage de la page de la source des renvois </b> : Affiche la page o&ugrave; se situe la porte &agrave; laquelle correspond le renvoi.
      </p></li><li><p>
        <b>Hauteur du commentaire</b> : Hauteur (en pixels) du commentaire situ&eacute; en haut de la porte. La valeur par d&eacute;faut est 40.
      </p></li><li><p>
        <b>Largeur du commentaire</b> : Largeur (en pixels) du commentaire situ&eacute; en haut de la porte. La valeur par d&eacute;faut est 100.
      </p></li></ul></div></div><div class="section" lang="fr"><div class="titlepage"><div><div><h3 class="title"><a name="option.OPTION_TAB_115_COURBE"></a>Courbes</h3></div></div></div><p>L'onglet Courbes permet de modifier la mani&egrave;re de tracer les courbes : 
    </p><div class="itemizedlist"><ul type="disc" compact><li><p>
        <b>Encadrer le graphique </b> : Permet d'encadrer le graphique.
      </p></li><li><p>
        <b>Encadrer les grandeurs g&eacute;n&eacute;riques </b> : Permet d'encadrer les donn&eacute;es g&eacute;n&eacute;riques situ&eacute;es sous les courbes.
      </p></li><li><p>
        <b>Afficher la grille </b> : Permet de tracer un quadrillage sur la zone de tracer de courbes.
      </p></li><li><p>
        <b>Afficher les l&eacute;gendes </b> : Permet d'afficher ou non la l&eacute;gende sous les courbes.
      </p></li><li><p>
        <b>Transparence de la zone de trac&eacute; </b> : Permet de rendre transparent la zone o&ugrave; les courbes sont trac&eacute;es. 
      </p></li><li><p>
        <b>Transparence du graphique </b> : Permet de rendre transparent la zone du graphique autour de la zone de tracer.
      </p></li><li><p>
        <b>Taille du titre </b> : Permet de sp&eacute;cifier la taille de la police du titre du graphique.
      </p></li><li><p>
        <b>Taille des grandeurs g&eacute;n&eacute;riques </b> : Permet de sp&eacute;cifier la taille de la police des donn&eacute;es g&eacute;n&eacute;riques.
      </p></li><li><p>
        <b>Taille des points </b> : Permet de sp&eacute;cifier la taille des points dessin&eacute;s sur les courbes.
      </p></li><li><p>
        <b>Taille des coordonn&eacute;es </b> : Permet de sp&eacute;cifier la taille de la police des coordonn&eacute;es.
      </p></li><li><p>
        <b>Taille des l&eacute;gendes </b> : Permet de sp&eacute;cifier la taille de la police des l&eacute;gendes.
      </p></li></ul></div></div></div></body></html>